In [2]:
import pandas as pd

weird = pd.DataFrame({1:["topdog", "botdog"], "1":["topcat", "botcat"]})

weird

# weird[1]
# weird[1:]
# weird["1"]

        1       1
0  topdog  topcat
1  botdog  botcat

In [3]:
# weird[1]
# weird[1:]
weird["1"]

0    topcat
1    botcat
Name: 1, dtype: object

In [4]:
weird[1]

0    topdog
1    botdog
Name: 1, dtype: object

In [5]:
weird[1:]

        1       1
1  botdog  botcat

In [6]:
weird[0:]

        1       1
0  topdog  topcat
1  botdog  botcat

In [7]:
weird.describe()

             1       1
count        2       2
unique       2       2
top     botdog  topcat
freq         1       1

In [8]:
titanic = pd.read_csv("data/titanic.csv")

In [9]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [10]:
titanic.head(8)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S

In [15]:
titanic.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [19]:
import numpy as np
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

#### Pandas DataFrame Function Index
| 序号 | DataFrame属性 | 功能 |
| :--- | :--- | :--- |
| 1 | df.index | 行索引 |
| 2 | df.columns | 列索引 |
| 3 | df.index.name | 行索引名字 |
| 4 | df.columns.name | 列索引名字 |
| 5 | df.values | 数据框内容 (numpy数组) |
| 6 | df.sum() | 按列求和 |
| 7 | df.count() | 按列计数 |
| 8 | df.max()/ df.min() | 按列最大/最小值 |
| 9 | df.median() | 按列中位数 |
| 10 | df.describe() | 按列描述统计 |
| 11 | df.loc[] | 控绝对位置查找 |
| 12 | df.loc[] | 按索引查找 |
| 13 | df.head() | 查看前5行数据 |
| 14 | df.tail() | 查看末尾5行数据 |
| 15 | df.dtypes | 查看表格数据类型 |
| 16 | df.shape | 查看表格行数列数 |
| 17 | df.rename | 修改行索引index或列索引columns |
| 18 | df.dropna | 删除有缺失值的行 |
| 19 | df[columns].astype | 修改列数据类型 |
| 20 | df.sort_values | 按某列值对数据行排序 |
| 21 | df.reset_index | 重置排序后的索引index |
| 22 | df.drop_duplicates | 数据去重 |